# PropertyIntersect Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..PropertyIntersect Property
BuiltInFailures..::..SiteFailures Class See Also
---
Property lines intersect. Area calculations will not be precise.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PropertyIntersect { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PropertyIntersect As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PropertyIntersect {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace